<?php
// Heading
$_['heading_title']     = 'Модуль интеграции СБИС';

// Text
$_['text_extension']    = 'Расширения';
$_['text_module']       = 'Модули';
$_['text_success']      = 'Настройки успешно изменены!';
$_['text_success_auth'] = 'Успешная авторизация! Выберите точку продажи и прайс лист чтобы синхронизировать данные с сервисом.';
$_['text_success_import'] = 'Задание успешно выполнено. Загружено %s новых товаров и %s новых разделов.';
$_['text_edit']         = 'Редактирование';

// Entry
$_['entry_admin']       = 'Только администраторы';
$_['entry_status']      = 'Статус';
$_['entry_app_id']      = 'ID приложения';
$_['entry_app_secret']  = 'Ключ приложения';
$_['entry_secret_key']  = 'Ключ пользователя';
$_['entry_sale_point']  = 'Точка продаж';
$_['entry_price_list']  = 'Прайс лист';

// Button
$_['button_auth']       = 'Авторизовать';
$_['button_exec']       = 'Синхронизировать';

// Error
$_['error_permission']  = 'У вас недостаточно прав для внесения изменений!';
$_['error_auth']        = 'Указаны неверные данные: %s';